**Задание 1**

Импортируйте нужный библиотеки

In [1]:
import psycopg2 as ps
import pandas as pd

**Задание 2**

В переменную conn запишите данные для подключения к базе данных

In [2]:
conn = ps.connect(host='localhost', port = 5432, database='demo', user='postgres', password='0000',
                  options='-c search_path=bookings')

**Задание 3**

Выгрузите из таблицы airports поля airport_name, city, timezone

In [7]:
airport = pd.read_sql("SELECT airport_name, city, timezone FROM airports;", con=conn)
airport

C:\Users\School252\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

        airport_name                      city          timezone
0             Якутск                    Якутск      Asia/Yakutsk
1             Мирный                    Мирный      Asia/Yakutsk
2    Хабаровск-Новый                 Хабаровск  Asia/Vladivostok
3            Елизово  Петропавловск-Камчатский    Asia/Kamchatka
4           Хомутово            Южно-Сахалинск     Asia/Sakhalin
..               ...                       ...               ...
99          Мурманск                  Мурманск     Europe/Moscow
100           Абакан                    Абакан  Asia/Krasnoyarsk
101          Барнаул                   Барнаул  Asia/Krasnoyarsk
102         Витязево                     Анапа     Europe/Moscow
103          Чульман                  Нерюнгри      Asia/Yakutsk

[104 rows x 3 columns]

**Задание 4**

Выгрузите первые четыре поля из таблицы Tickets. Ограничьте выгрузку первыми 10 записями.

In [9]:
tickets = pd.read_sql('SELECT ticket_no, book_ref, passenger_id, passenger_name FROM tickets LIMIT 10;', con=conn)
tickets

C:\Users\School252\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

       ticket_no book_ref passenger_id       passenger_name
0  0005432000987   06B046  8149 604011     VALERIY TIKHONOV
1  0005432000988   06B046  8499 420203   EVGENIYA ALEKSEEVA
2  0005432000989   E170C3  1011 752484      ARTUR GERASIMOV
3  0005432000990   E170C3  4849 400049        ALINA VOLKOVA
4  0005432000991   F313DD  6615 976589        MAKSIM ZHUKOV
5  0005432000992   F313DD  2021 652719       NIKOLAY EGOROV
6  0005432000993   F313DD  0817 363231    TATYANA KUZNECOVA
7  0005432000994   CCC5CB  2883 989356       IRINA ANTONOVA
8  0005432000995   CCC5CB  3097 995546  VALENTINA KUZNECOVA
9  0005432000996   1FB1E4  6866 920231    POLINA ZHURAVLEVA

**Задание 5**

Выведите первые 20 записей из таблицы flights. Оставьте в итоговой таблице только два поля: scheduled_departure и departure_airport

In [10]:
flights = pd.read_sql('SELECT scheduled_departure, departure_airport FROM flights LIMIT 20;', con=conn)
flights.head()

C:\Users\School252\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

         scheduled_departure departure_airport
0  2017-09-10 06:50:00+00:00               DME
1  2017-08-25 11:50:00+00:00               VKO
2  2017-09-05 09:30:00+00:00               VKO
3  2017-09-12 06:50:00+00:00               SVO
4  2017-09-04 09:25:00+00:00               SVO
5  2017-09-10 12:00:00+00:00               SVO
6  2017-08-28 06:00:00+00:00               LED
7  2017-08-24 12:05:00+00:00               SVX
8  2017-09-12 07:15:00+00:00               KZN
9  2017-08-26 13:05:00+00:00               KZN
10 2017-08-18 13:25:00+00:00               ROV
11 2017-09-06 04:05:00+00:00               PEE
12 2017-09-05 09:25:00+00:00               JOK
13 2017-09-14 09:25:00+00:00               SCW
14 2017-09-11 03:35:00+00:00               MJZ
15 2017-08-31 08:35:00+00:00               UUA
16 2017-08-26 07:55:00+00:00               UUA
17 2017-09-02 03:50:00+00:00               SWT
18 2017-09-05 06:15:00+00:00               EYK
19 2017-08-26 12:00:00+00:00               TJM

**Задание 6**

Выгрузите из таблицы Bookings поля book_ref и book_date. Оба поля должны быть строками.

Используйте тип данных для строк нефиксированной длины.

In [22]:
bookings = pd.read_sql('SELECT CAST(book_ref AS varchar), CAST(book_date AS varchar) FROM bookings;', con=conn)
bookings.head()

C:\Users\School252\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  book_ref               book_date
0   00000F  2017-07-05 03:12:00+03
1   000012  2017-07-14 09:02:00+03
2   000068  2017-08-15 14:27:00+03
3   000181  2017-08-10 13:28:00+03
4   0002D8  2017-08-07 21:40:00+03

**Задание 7**

Выгрузите из таблицы Bookings поле total_amount. Оставьте только целую часть числа.

In [23]:
bookings1 = pd.read_sql('SELECT CAST(total_amount AS int) FROM bookings;', con=conn)
bookings1.head()

C:\Users\School252\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   total_amount
0        265700
1         37900
2         18100
3        131800
4         23600

**Задание 8**

Выгрузите из таблицы flights дни перелетов. Необходимые значения в виде строк хранит поле scheduled_departure. 


Сформируйте запрос так, чтобы на экране отобразилась только дата.

In [25]:
flights_1 = pd.read_sql('SELECT CAST(scheduled_departure AS date) FROM flights;', con=conn)
flights_1.head()

C:\Users\School252\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  scheduled_departure
0          2017-09-10
1          2017-08-25
2          2017-09-05
3          2017-09-12
4          2017-09-04

**Задание 9**

Выгрузите из таблицы flights время отправления. Необходимые значения в виде строк хранит поле scheduled_departure. 


Сформируйте запрос так, чтобы на экране отобразилась только время.

In [26]:
flights_2 = pd.read_sql('SELECT CAST(scheduled_departure AS time) FROM flights;', con=conn)
flights_2.head()

C:\Users\School252\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  scheduled_departure
0            09:50:00
1            14:50:00
2            12:30:00
3            09:50:00
4            12:25:00

**Задание 10**

Изучите таблицу bookings


Поле total_amount хранит общую стоимость включённых в бронирование перелетов всех пассажиров.

Выгрузите все значения из таблицы, отфильтровав стоимостью перелета 50 000

In [27]:
bookings2 = pd.read_sql('SELECT * FROM bookings WHERE total_amount=50000 ;', con=conn)
bookings2.head()

C:\Users\School252\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  book_ref                 book_date  total_amount
0   00A48B 2017-07-11 16:29:00+00:00       50000.0
1   00CA80 2017-07-18 14:30:00+00:00       50000.0
2   014C33 2017-07-27 19:17:00+00:00       50000.0
3   014E39 2017-07-12 23:46:00+00:00       50000.0
4   016E4E 2017-08-05 12:45:00+00:00       50000.0

**Задание 11**

Изучите таблицу airports

Выгрузите все значения из таблицы, отфильтровав по городу Санкт-Петербург

In [28]:
airport_1 = pd.read_sql("SELECT * FROM airports WHERE city = 'Санкт-Петербург';", con=conn)
airport_1

C:\Users\School252\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,airport_code,airport_name,city,coordinates,timezone
0,LED,Пулково,Санкт-Петербург,"(30.262500762939453,59.80030059814453)",Europe/Moscow

**Задание 12**

Изучите таблицу aircrafts

Выгрузите все значения из таблицы, отфильтровав по дальности перелета более 4000 км

Столбец range хранит Максимальную дальность полета, км

In [29]:
aircrafts = pd.read_sql("SELECT * FROM aircrafts WHERE range > 4000", con=conn)
aircrafts

C:\Users\School252\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  aircraft_code             model  range
0           773     Боинг 777-300  11100
1           763     Боинг 767-300   7900
2           320  Аэробус A320-200   5700
3           321  Аэробус A321-200   5600
4           319  Аэробус A319-100   6700
5           733     Боинг 737-300   4200